movie_list/app/views/movies/show.html.erb

    <% @reviews.each do |review| %>
      <p>Name: <%= User.find(review.user_id).name %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]