movie_list/app/views/bookmarks/index.html.erb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 299537], ["LIMIT", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 324857], ["LIMIT", 1]]
---
    <div class="each-bookmark">
      <p class="bookmark-title"><a href="/movies/<%= bookmark.movie_id%>"><%= Movie.find(bookmark.movie_id).title%></a></p>
      <img class="movie_poster" src="https://image.tmdb.org/t/p/original<%= Movie.find(bookmark.movie_id).poster%>">