app/controllers/movies_controller.rb

  def show
    if Movie.find_by(id: params[:id]) == nil
      @movie = save_movie(params[:id],params[:date])
    else
      @movie = Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 581310], ["LIMIT", 1]]