app/controllers/movies_controller.rb

  def search
    @url= "https://api.themoviedb.org/3/search/movie?api_key=74e7e1d6b0003e43c02532361ec804ed&query=#{params[:movie_title]}"
    @data = HTTParty.get(@url)
---
SELECT  "movies".* FROM "movies" ORDER BY "movies"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def save_movie(id, date)
    movie = Movie.new
    url="https://api.themoviedb.org/3/movie/#{id}?api_key=74e7e1d6b0003e43c02532361ec804ed"
    data = HTTParty.get(url)
    movie.id = id
    movie.poster = data["poster_path"]
    movie.title = data["title"]
    movie.plot = data["overview"]
    movie.rating = data["vote_average"]
    movie.genre = genre_list(data)
    movie.released = date || data["release_date"]
    movie.save!
---
INSERT INTO "movies" ("id", "title", "poster", "released", "genre", "plot", "rating", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def show
    if Movie.find_by(id: params[:id]) == nil
      @movie = save_movie(params[:id],params[:date])
    else
      @movie = Movie.find(params[:id])
    end
    @reviews = Review.where(movie_id: params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 114150], ["LIMIT", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 445629], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = $1  [["movie_id", 280217]]