app/controllers/reviews_controller.rb

  def create
    review = Review.new
    review.user_id = session[:user_id]
    review.movie_id = params[:id]
    review.ratings = params[:rating]
    review.comment = params[:comment]
    review.save!
---
INSERT INTO "reviews" ("user_id", "movie_id", "ratings", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 5], ["movie_id", 329996], ["ratings", 2], ["comment", "It was ok"], ["created_at", "2019-03-19 02:56:03.648811"], ["updated_at", "2019-03-19 02:56:03.648811"]]