app/controllers/users_controller.rb

  def create
    user = User.new
    user.name = params[:name]
    user.email = params[:email]
    user.password = params[:password]
    user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "meme"], ["email", "jo@ga.co"], ["password_digest", "pudding"], ["created_at", "2019-03-16 06:12:58.335308"], ["updated_at", "2019-03-16 06:12:58.335308"]]

  def sign_in
    user = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jo@ga.co"], ["LIMIT", 1]]

  def edit
    @user = User.find_by(id: session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def show
    @user = User.find_by(id: session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def update
    user = User.find_by(id: session[:user_id])
    user.name = params[:name]
    user.email = params[:email]
    user.password = params[:password]
    user.save!
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$zPHObYFTjOJUvmxnXDaZieqjjheAkcvGNP75sSnIukwURO/cQrFf6"], ["updated_at", "2019-03-20 06:49:48.205754"], ["id", 5]]