movie_list/app/controllers/bookmarks_controller.rb

INSERT INTO "bookmarks" ("user_id", "movie_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["movie_id", 299537], ["created_at", "2019-03-18 23:34:40.124523"], ["updated_at", "2019-03-18 23:34:40.124523"]]
---
  def create
    bookmark = Bookmark.new
    bookmark.user_id = session[:user_id]
    bookmark.movie_id = params[:movie_id]
    bookmark.save

DELETE FROM "bookmarks" WHERE "bookmarks"."id" = $1  [["id", 2]]
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def destroy
    Bookmark.find_by(id: params[:bookmark_id]).destroy