movie_list/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "meme"], ["email", "jo@ga.co"], ["password_digest", "pudding"], ["created_at", "2019-03-16 06:12:58.335308"], ["updated_at", "2019-03-16 06:12:58.335308"]]
---
  def create
    user = User.new
    user.name = params[:name]
    user.email = params[:email]
    user.password = params[:password]
    user.save

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jo@ga.co"], ["LIMIT", 1]]
---
  def sign_in
    user = User.find_by(email: params[:email])